InformationRegisters/ПаролиСвободныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПаролиСвободныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Неактивен</Name>
					<Comment>Признак служит для отключения доступа через Web интерфейс</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПаролиСвободныеСотрудники/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Генерирует пароль для входа в Web интерфейс свободно-занятых сотрудников
//
// Параметры:
//  Сотрудник  - <Тип.СправочникСсылка.ФизическиеЛица> - Физ. лицо.
//
// Возвращаемое значение:
//   Структура параметров <Тип.Структура>   - Структура параметров, содержащая Логин и Пароль
//
Функция СгенерироватьПарольСвободноЗанятогоСотрудника(Сотрудник) Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Пароль = "";
	ИспользуемыеСимволы = "1243456789AQWERTYUIPASDFGHJKLZXCVBNMqwertyuipasdfghjklzxcvbnm";
	
	КвоСимволов = СтрДлина(ИспользуемыеСимволы);
	Пока СтрДлина(Пароль) < 7 Цикл
		НовыйСимвол = Сред(ИспользуемыеСимволы ,(ГСЧ.СлучайноеЧисло(1, КвоСимволов)),1);
		Пароль = Пароль + НовыйСимвол;
	КонецЦикла;        
	
	Возврат Новый Структура("Логин, Пароль", "L" + ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник,"Код"), Пароль);
	  
КонецФункции // СгенерироватьПарольСвободноЗанятогоСотрудника()
